tutorials/3D/Fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep false;//true;

maxCo 1;
maxAlphaCo      0.5;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }

	/*forces
	{
	    type            forceCoeffs;
	    libs            ("libforces.so");
	    writeControl    timeStep;
	    writeInterval   10;

	    patches         ("Aile.*");
	    rho             rhoInf;      // Indicates incompressible
	    log             true;
	    rhoInf          1000;           // Redundant for incompressible
		origin      (0 0 0); 
	    liftDir         (0 1 0);
	    dragDir         (1 0 0);
	    //CofR            (0.72 0 0);  // Axle midpoint on ground
	    //pitchAxis       (0 1 0);
	    magUInf         5;
	    //lRef            1.42;        // Wheelbase length
	    //Aref            0.75;        // Estimated
	}*/
}

// ************************************************************************* //
