tutorials/3D/Fluid/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;//polynomial;
    thermo          hConst;//hpolynomial;
    equationOfState adiabaticPerfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;//sensibleEnthalpy;//InternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18;
    }
    thermodynamics
    {
        Cp          4185; 
        Hf          0;
	Sf		0;
    }
    transport
    {
	mu          1.e-3;
        Pr          7.;
    }
    equationOfState
    {
	p0	2338.6;
	rho0	998.16;
	B	3.06e8;
	gamma	7.1;
    }
}


// ************************************************************************* //
