tutorials/3D/Fluid/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
rho rho [1 -3 0 0 0 0 0 ] 1000.0;
nu nu  [0 2 -1 0 0 0 0] 1e-06;
pRef pRef [1 -1 -2 0 0 0 0 ] 1e5;

// ************************************************************************* //
