tutorials/3D/Fluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            zeroGradient;//fixedValue;//fixedFluxPressure;//zeroGradient;
 		value           $internalField;
    }
    Outlet
    {
        type            fixedValue;//totalPressure;//fixedValue;//fixedFluxPressure;//fixedValue;
		value			$internalField;
    }
	Top
	{
		type			zeroGradient;
		value			$internalField;
	}
	Bottom
	{
		type			zeroGradient;
		value			$internalField;
	}
	Back
	{
		type			zeroGradient;
		value			$internalField;
	}
	Front
	{
		type			zeroGradient;
		value			$internalField;
	}
        Cylinder_ext
        {
                type                    zeroGradient;
                value                   $internalField;
        }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    Aile
    {
        type            zeroGradient;//fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
