tutorials/3D/Fluid/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            fixedValue;//zeroGradient;//inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    Aile
    {
        type            zeroGradient;
        value           $internalField;
    }
	Top
	{
		type			zeroGradient;
		value			$internalField;
	}
	Bottom
	{
		type			zeroGradient;
		value			$internalField;
	}
	Back
	{
		type			zeroGradient;
		value			$internalField;
	}
	Front
	{
		type			zeroGradient;
		value			$internalField;
	}
        Cylinder_ext
        {
                type                    zeroGradient;
                value                   $internalField;
        }

    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //

