tutorials/3D/Fluid/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.000001;

boundaryField
{
    Front
    {
        type            fixedValue;
        value           uniform 0;
    }
    Back
    {
        type            fixedValue;
        value           uniform 0;
    }
    Top
    {
        type            fixedValue;
        value           uniform 0;
    }
    Bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    Aile
    {
        type            fixedValue;
        value           uniform 0;
    }
    AMI1
    {
        type            cyclicAMI; 
        value           $internalField;
    }
    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //

