tutorials/3D/Fluid/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    Outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    Back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Aile
    {
        type            fixedValue;
        value           $internalField;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    Top
    {
        type            slip;
    }

    Bottom
    {
        type            slip;
    }
    Front
    {
        type            slip;
    }
}

