tutorials/3D/Fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*    "(p|rho)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(p|rho)Final"
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        relTol          0;
    }

    "(U|e|k|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|e|k|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
    "e"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-2;
        relTol          0.01;
    }

    "eFinal"
    {
        $e;
        relTol          0;
    }*/
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.0001;
        smoother        GaussSeidel;
        cacheAgglomeration true;
	nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        smoother        GaussSeidel;//DICGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        relTol          0;
    }

    Phi
    {
        $p;
    }


   "(U|k|epsilon|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|k|epsilon|nuTilda)Final"
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }

  /*  "(U|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }

    "(U|nuTilda)Final"
    {
     $nuTilda;
     relTol 0;
    }*/

    cellDisplacement
    {
        solver          PCG;//smoothSolver;
        preconditioner DIC;
        //smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
        relTol          0;
    }

    Phi
    {
        $p;
    }
}

PIMPLE
{
	momentumPredictor yes;
    nOuterCorrectors 30;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
    outerCorrectorResidualControl
    {
        U  { relTol 0; tolerance 1e-6; }
        p  { relTol 0; tolerance 1e-6; } 
	//e  { relTol 0; tolerance 1e-2; }
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


relaxationFactors
{
     fields
     {
         p               1;
     }
/*     equations
     {
         U               1;
         "(k|omega|epsilon).*" 1;
     }*/
}

// ************************************************************************* //
